Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 98, 256)           37888     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 32, 256)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 30, 256)           196864    
_________________________________________________________________
dense (Dense)                (None, 30, 1024)          263168    
_________________________________________________________________
dropout (Dropout)            (None, 30, 1024)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 30, 512)           524800    
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 512)           0         
_________________________________________________________________
dense_2 (Dense)              (None, 30, 256)           131328    
_________________________________________________________________
dense_3 (Dense)              (None, 30, 128)           32896     
_________________________________________________________________
flatten (Flatten)            (None, 3840)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 3841      
=================================================================
Total params: 1,190,785
Trainable params: 1,190,785
Non-trainable params: 0
_________________________________________________________________
Batch size = 16
learn rate = 1e-05
Num epochs = 330

train:
RMSE:1.2993
R:0.9888
p:0.0
R_spear:0.9792
NRMSE:0.0591
CCC:0.9688912869193497


test:
RMSE:5.2068
R:0.3244
p:0.0987
R_spear:0.271
NRMSE:0.2367
CCC:0.2581521739130435
