Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 98, 256)           37888     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 32, 256)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 30, 256)           196864    
_________________________________________________________________
dense (Dense)                (None, 30, 1024)          263168    
_________________________________________________________________
dropout (Dropout)            (None, 30, 1024)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 30, 512)           524800    
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 512)           0         
_________________________________________________________________
dense_2 (Dense)              (None, 30, 256)           131328    
_________________________________________________________________
dense_3 (Dense)              (None, 30, 128)           32896     
_________________________________________________________________
flatten (Flatten)            (None, 3840)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 3841      
=================================================================
Total params: 1,190,785
Trainable params: 1,190,785
Non-trainable params: 0
_________________________________________________________________
Batch size = 64
learn rate = 0.0001
Num epochs = 121

train:
RMSE:1.7347
R:0.9888
p:0.0
R_spear:0.9852
NRMSE:0.0788
CCC:0.9401545248603448


test:
RMSE:4.3076
R:0.5562
p:0.0026
R_spear:0.5144
NRMSE:0.1958
CCC:0.45056991122623863
