Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 98, 256)           37888     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 32, 256)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 30, 256)           196864    
_________________________________________________________________
dense (Dense)                (None, 30, 1024)          263168    
_________________________________________________________________
dropout (Dropout)            (None, 30, 1024)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 30, 512)           524800    
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 512)           0         
_________________________________________________________________
dense_2 (Dense)              (None, 30, 256)           131328    
_________________________________________________________________
dense_3 (Dense)              (None, 30, 128)           32896     
_________________________________________________________________
flatten (Flatten)            (None, 3840)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 3841      
=================================================================
Total params: 1,190,785
Trainable params: 1,190,785
Non-trainable params: 0
_________________________________________________________________
Batch size = 64
learn rate = 1e-05
Num epochs = 430

train:
RMSE:2.0632
R:0.9472
p:0.0
R_spear:0.9344
NRMSE:0.0794
CCC:0.932289656796935


test:
RMSE:5.1854
R:0.5053
p:0.0072
R_spear:0.3976
NRMSE:0.1994
CCC:0.44465663288458634
